src/main/resources/xmls/salesforcequery/CreateTGSOpportunity.xml

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
	<Header>
		<SessionHeader xmlns="urn:partner.soap.sforce.com">
			<sessionId></sessionId>
		</SessionHeader>
	</Header>
	<Body>
		<create xmlns="urn:partner.soap.sforce.com">
			<sObjects>

				<type xmlns="urn:sobject.partner.soap.sforce.com">Opportunity</type>
				<Name xmlns="">TestTGSOpportunity</Name>
				<CloseDate xmlns=""></CloseDate>
				<AccountId xmlns=""></AccountId>
				<StageName xmlns=""></StageName>
				<RecordTypeId xmlns=""></RecordTypeId>
				<Segment__c xmlns=""></Segment__c>
				<Organization_Office__c	 xmlns=""></Organization_Office__c>
				<Sales_Organization__c xmlns=""></Sales_Organization__c>
				<Regional_Director__c xmlns=""></Regional_Director__c>
				<Practice_Engagement__c xmlns=""></Practice_Engagement__c>
				<Primary_Service_Type__c xmlns=""></Primary_Service_Type__c>
				
				</sObjects>

		</create>
	</Body>
</Envelope>